sample-results-gemfire-colocated-3vm-10klength/output_gemfire_homelab_colocated_3vm_10000_10t_10ksize_run.txt
/var/vcap/packages/jdk/bin/java  -classpath /root/workspace/YCSB-geode-custom/conf:/root/workspace/YCSB-geode-custom/core/target/core-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-core-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/geode-binding-0.18.0-SNAPSHOT.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/HdrHistogram-2.1.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/LatencyUtils-2.0.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/antlr-2.7.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/awaitility-4.2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/bson-4.8.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/classgraph-4.8.154.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-beanutils-1.9.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-codec-1.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-collections-3.2.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-digester-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-io-2.11.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-lang3-3.12.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-logging-1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/commons-validator-1.7.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/fastutil-8.5.11.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-common-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-core-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-deployment-chained-classloader-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-logging-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-management-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-membership-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-serialization-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-messenger-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-tcp-server-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-unsafe-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/gemfire-version-10.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/hamcrest-2.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpclient-4.5.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/httpcore-4.4.16.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/istack-commons-runtime-4.0.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-annotations-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-core-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-databind-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-joda-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jackson-datatype-jsr310-2.16.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.activation-api-1.2.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.resource-api-1.7.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/javax.transaction-api-1.3.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-api-2.3.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jaxb-impl-2.3.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jgroups-3.6.14.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jna-platform-5.12.1.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/joda-time-2.10.14.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/jopt-simple-5.0.4.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/log4j-api-2.19.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-commons-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-core-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/micrometer-observation-1.10.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-buffer-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-codec-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-handler-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-resolver-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/netty-transport-native-unix-common-4.1.108.Final.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/rmiio-2.1.2.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-cache-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-config-ogdl-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-cipher-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-core-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-crypto-hash-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-event-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/shiro-lang-1.13.0.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/slf4j-api-1.7.25.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-beans-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-core-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-jcl-5.3.34.jar:/root/workspace/YCSB-geode-custom/geode/target/dependency/spring-web-5.3.34.jar site.ycsb.Client -t -db site.ycsb.db.GeodeClient -P ../workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
Command line: -t -db site.ycsb.db.GeodeClient -P ../workloads/workloada -p geode.locator=192.168.0.78[55221] -P ./ycsb.config -P ./gemfire.config -s
[INFO] core.Client recordcount:10000
[INFO] core.Client threadcount:10
[INFO] core.Client operationcount:10000
[INFO] core.Client readproportion:0.5
[INFO] core.Client updateproportion:0.5
[INFO] core.Client fieldlength:10000
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
[INFO] core.CoreWorkload fieldlength:10000
Starting test.
2024-04-22 13:35:04:627 0 sec: 0 operations; est completion in 0 second 
ERROR StatusLogger Log4j2 could not find a logging implementation. Please add log4j-core to the classpath. Using SimpleLogger to log to the console...
[INFO] geode.Creating Cache
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
[INFO] geode.Created Cache: geode-client
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[INFO] core.ClientThread initialized: threadid: 5
[INFO] core.ClientThread initialized: threadid: 9
[INFO] core.ClientThread initialized: threadid: 3
[INFO] core.ClientThread initialized: threadid: 6
[INFO] core.ClientThread initialized: threadid: 0
[INFO] core.ClientThread initialized: threadid: 7
[INFO] core.ClientThread initialized: threadid: 2
[INFO] core.ClientThread initialized: threadid: 1
[INFO] core.ClientThread initialized: threadid: 8
[INFO] core.ClientThread initialized: threadid: 4
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
[INFO] geode.UserPasswordAuthInit security-username: cluster_operator_kSZXA6unTmdKT3slnH5EJg
2024-04-22 13:35:11:639 7 sec: 10000 operations; 1403.11 current ops/sec; [READ: Count=5034, Max=1195007, Min=202, Avg=6433.38, 90=9383, 99=57311, 99.9=429311, 99.99=1159167] [CLEANUP: Count=10, Max=1, Min=0, Avg=0.2, 90=1, 99=1, 99.9=1, 99.99=1] [UPDATE: Count=4966, Max=1116159, Min=239, Avg=4677.49, 90=7375, 99=31167, 99.9=217727, 99.99=1116159] 
[OVERALL], RunTime(ms), 7127
[OVERALL], Throughput(ops/sec), 1403.1149151115476
[TOTAL_GCS_G1_Young_Generation], Count, 22
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 96
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.3469903185070857
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 22
[TOTAL_GC_TIME], Time(ms), 96
[TOTAL_GC_TIME_%], Time(%), 1.3469903185070857
[READ], Operations, 5034
[READ], AverageLatency(us), 6433.378625347636
[READ], MinLatency(us), 202
[READ], MaxLatency(us), 1195007
[READ], 95thPercentileLatency(us), 18095
[READ], 99thPercentileLatency(us), 57311
[READ], Return=OK, 5034
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 0.2
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[UPDATE], Operations, 4966
[UPDATE], AverageLatency(us), 4677.487112364076
[UPDATE], MinLatency(us), 239
[UPDATE], MaxLatency(us), 1116159
[UPDATE], 95thPercentileLatency(us), 11311
[UPDATE], 99thPercentileLatency(us), 31167
[UPDATE], Return=OK, 4966